app/Controllers/UserCrud.php

    public function index(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

    public function store() {
        $userModel = new UserModel();
        $data = [
            'name' => $this->request->getPost('name'),
            'email'  => $this->request->getPost('email'),
            'phone'  => $this->request->getPost('phone'),
            'age'  => $this->request->getPost('age'),
            'address'  => $this->request->getPost('address'),
        ];
        $userModel->insert($data);
---
INSERT INTO `users` (`name`, `email`, `phone`, `age`, `address`) VALUES ('sdgsg', 'sdg@gad.com', '3245645', '155', 'dagdfg')

    public function singleUser($id = null){
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '9'
 LIMIT 1

    public function delete($id = null){
        $userModel = new UserModel();
        $data['user'] = $userModel->where('id', $id)->delete($id);
---
DELETE FROM `users`
WHERE `id` = '7'
AND `id` IN ('7')